Tekla Open API Reference for Tekla Structures 2025
View.Insert Method
Inserts a new view to the model.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Insert()
Public Function Insert As Boolean
Return Value
Type: Boolean
True if the operation was successful.
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace